{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend entry point.",
  "feature_evidence.json": "Feature evidence report mapping five main features (homepage navigation, beginner/intermediate/advanced sections, and glossary) to their implementing files, components, and test IDs with high confidence ratings.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing the React app structure, educational components, data files with stock market content, and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI elements, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with root div and module script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with five routes (home, beginner, intermediate, advanced, glossary) wrapped in a shared Layout component.",
  "frontend/src/components/education/DiagramDisplay.tsx": "Image component with zoom functionality using a dialog modal, displaying educational diagrams with optional captions and hover zoom icon.",
  "frontend/src/components/education/LessonCard.tsx": "Card component displaying lesson title, description, content text, optional diagram, and difficulty badge with color-coded styling.",
  "frontend/src/components/education/Tutorial.tsx": "Tutorial card component showing prerequisites, learning objectives, and numbered step-by-step instructions with icons and badges.",
  "frontend/src/components/glossary/TermCard.tsx": "Accordion-based card displaying glossary term with expandable definition, example, and related terms as badges.",
  "frontend/src/components/layout/Footer.tsx": "Footer with three-column layout showing site info, quick links, disclaimer, copyright notice, and caffeine.ai attribution with UTM parameters.",
  "frontend/src/components/layout/Header.tsx": "Navigation header component with responsive design, featuring a logo, desktop navigation links (Beginner, Intermediate, Advanced, Glossary), and a mobile sheet menu with hamburger icon.",
  "frontend/src/components/layout/Layout.tsx": "Main layout wrapper component that renders the Header, an Outlet for nested routes, and a Footer in a flex column structure.",
  "frontend/src/components/reference/QuickReferenceCard.tsx": "Card component displaying a title, description, and list of label-value pairs with a print button for generating printable reference sheets.",
  "frontend/src/data/advancedContent.ts": "Content data for advanced trading lessons including strategies (momentum, mean reversion, pairs trading), options fundamentals, risk management techniques, and market psychology concepts.",
  "frontend/src/data/beginnerContent.ts": "Defines ContentItem interface and exports beginner-level lessons covering stock basics, market mechanics, bull/bear markets, getting started with investing, and understanding risk.",
  "frontend/src/data/glossaryTerms.ts": "Defines GlossaryTerm interface and exports an array of stock market terminology definitions with examples and related terms (ask, bid, bear market, beta, dividends, etc.).",
  "frontend/src/data/intermediateContent.ts": "Content data for intermediate-level lessons covering chart reading, technical analysis indicators and patterns, fundamental analysis metrics, and portfolio diversification strategies.",
  "frontend/src/data/quickReferences.ts": "Defines the QuickReference interface and exports an array of quick reference guides for beginner, intermediate, and advanced levels, covering topics like stock market basics, technical analysis, portfolio allocation, and options strategies.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options for idle handling and derivation origins.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for a financial-themed design system, including light/dark mode color schemes, chart colors, and print styles for reference guides.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component into the DOM.",
  "frontend/src/pages/AdvancedPage.tsx": "Displays advanced-level educational content with tabs for lessons and tutorials, plus quick reference guides filtered for advanced users, targeting experienced investors seeking sophisticated trading strategies.",
  "frontend/src/pages/BeginnerPage.tsx": "Renders beginner-level educational content with tabbed lessons and tutorials, plus quick reference guides for new investors learning stock market fundamentals.",
  "frontend/src/pages/GlossaryPage.tsx": "Implements a searchable glossary page that filters and displays stock market terms alphabetically, with search functionality across terms, definitions, and examples.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component featuring a hero section with gradient text, three learning path cards (Beginner, Intermediate, Advanced) with icons and feature lists, and navigation buttons to start learning or browse the glossary.",
  "frontend/src/pages/IntermediatePage.tsx": "Intermediate level education page with tabbed interface displaying lessons and tutorials filtered from intermediateContent data, plus a quick reference guides section for intermediate-level resources.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, custom animations for accordions, and typography/container-queries plugins.",
  "project_state.json": "Project metadata file documenting the stock market education website architecture, completed features mapped to requirements, image asset specifications, and technical notes about the React/Tailwind implementation with three difficulty tiers."
}